# Home - xls
WALL_TYPE = {
    'М': 'Монолит',
    'КМ': 'Кирпич-монолит',
    'П': 'Панель',
}

# Home - calc, Plans - xls
TRIM_SHORT = {
    'НЕТ': 'Без отделки',
    'ПРЕД': 'Предчистовая',
    'ПОЛН': 'Полная',
}

# Home - calc, Plans - xls
TRIM_FULL = {
    'НЕТ': 'Без отделки',
    'ПРЕД': 'Предчистовая отделка',
    'ПОЛН': 'Полная отделка',
}

# Plan - xls
ROOM_SHORT = {
    '0': 'Студия',
    '1': '1-ком.',
    '2': '2-ком.',
    '3': '3-ком.',
    '4': '4-ком.',
}

# ShortPlan
ROOM_MIDDLE = {
    '0': 'Студии',
    '1': '1-ком.',
    '2': '2-ком.',
    '3': '3-ком.',
    '4': '4 и больше',
}

# Plan - xls
ROOM_FULL = {
    '0': 'Студия',
    '1': '1-комнатная',
    '2': '2-комнатная',
    '3': '3-комнатная',
    '4': '4-комнатная или больше',
}

# Home - calc, Blocks - utils
YEAR_MONTH = {
    1: 'январь',
    2: 'февраль',
    3: 'март',
    4: 'апрель',
    5: 'май',
    6: 'июнь',
    7: 'июль',
    8: 'август',
    9: 'сентябрь',
    10: 'октябрь',
    11: 'ноябрь',
    12: 'декабрь',
}

# Home - calc
YEAR_PART = {
    1: 'начало',
    2: 'начало',
    3: 'начало',
    4: 'начало',
    5: 'середина',
    6: 'середина',
    7: 'середина',
    8: 'середина',
    9: 'конец',
    10: 'конец',
    11: 'конец',
    12: 'конец',
}

# Home - utils
METRO_LINE_COLOR = {
    1: 'red',
    2: 'blue',
    3: 'green',
    4: 'orange',
    5: 'violet',
}
